app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page]).per_page(Settings.per_page)
---
SELECT "users".* FROM "users"

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "xhgfj,bkjb"], ["email", "dxgcvb"], ["created_at", "2020-10-20 03:50:27.405671"], ["updated_at", "2020-10-20 03:50:27.405671"]]

  def load_user
    @user = User.find_by id: params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]